// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let arr = [1, 2, 3, 4, 5, '1', '2', '3', '4', '5', true,false]
// console.log(arr)

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arr = []
// arr[0] = true
// arr[1] = '1'
// arr[2] = 1
// arr[3] = ['1',2]
// console.log(arr)

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>${i} шотатам </div>`)
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0; i < 10; i++) {
//     document.write(`<div>шотатам з ${i} індексом </div>`)
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let i = 0
// while (i !== 10){
//     document.write(`<h1>Шотатам</h1>`)
//     i++
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let i = 0
// while (i !== 20){
//     document.write(`<h1> Lorem ipsum dolor sit amet.${i} </h1>`)
//     i++
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let arr = [1,2,3,4,5,6,7,8,9,0]
// for (const number of arr) {
//     console.log(number)
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let arr = ['1','2','3','4','5','6','7','8','9','0']
// for (const item of arr) {
//     console.log(item)
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let arr = [true,5,2,7,['1'],'1',null,false,'2', {1:'1'}]
// for (const item of arr) {
//     console.log(item)
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let arr = [1, 2, 3, 4, '1', '2', '3', '4', true, false]
// for (const item of arr) {
//     if (typeof item === "boolean") {
//         console.log(item)
//     }
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let arr = [1, 2, 3, 4, '1', '2', '3', '4', true, false]
// for (const item of arr) {
//     if (typeof item === "number") {
//         console.log(item)
//     }
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let arr = [1, 2, 3, 4, '1', '2', '3', '4', true, false]
// for (const item of arr) {
//     if (typeof item === "string") {
//         console.log(item)
//     }
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let arr = []
// for (let i = 0; i < 10; i++) {
//     arr[i] = `element ${i}`
// }
// for (const item of arr) {
//     console.log(item)
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 10; i++) {
//     console.log(i)
//     document.write(`${i} <br>`)
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i++) {
//     console.log(i)
//     document.write(`${i} <br>`)
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 200; i+=2) {
//     console.log(i)
//     document.write(`${i} <br>`)
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (let i = 2; i < 202; i+=2) {
//     console.log(i)
//     document.write(`${i} <br>`)
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (let i = 1; i < 201; i+=2) {
//     console.log(i)
//     document.write(`${i} <br>`)
// }